<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"295f12c4dd8a978191dc4d84498cd43209037c6fad4eafaefa7c33addbd6e380","plan_job_ref":"Job Run Terraform plan in staging #260 at https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/14932925581","plan_out_hash":"e4f74d670f77ab1e6200e5d94dbcf305ad47234106918b1632801e4cc6267cdd","plan_hash":"562ebe6c93e22b5332edb1540a452759486e9ee5d0ee9e098d248d501cae950c","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan in __terraform__
With var files: `terraform/staging.tfvars`
<details>
<summary>Plan: 0 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # cloudfoundry_network_policy.egress_routing will be updated in-place
!~  resource "cloudfoundry_network_policy" "egress_routing" {
!~      policies = [
!~          {
!~              destination_app = "c7dc11b3-bfae-469d-817d-5d5fd190206c" -> (known after apply)
#                (3 unchanged attributes hidden)
            },
!~          {
!~              destination_app = "c7dc11b3-bfae-469d-817d-5d5fd190206c" -> (known after apply)
#                (3 unchanged attributes hidden)
            },
        ]
    }

  # module.egress_proxy.cloudfoundry_app.egress_app will be updated in-place
!~  resource "cloudfoundry_app" "egress_app" {
!~      created_at                  = "2025-05-05T21:38:13Z" -> (known after apply)
!~      disk_quota                  = "2048M" -> (known after apply)
!~      enable_ssh                  = false -> (known after apply)
!~      environment                 = {
!~          "PROXY_ALLOW"    = <<-EOT
                raw.githubusercontent.com
              + saml-proxy-staging.app.cloud.gov
            EOT
#            (4 unchanged elements hidden)
        }
!~      health_check_type           = "port" -> (known after apply)
!~      id                          = "************************************" -> (known after apply)
!~      log_rate_limit_per_second   = "-1" -> (known after apply)
        name                        = "egress-proxy-staging"
!~      readiness_health_check_type = "process" -> (known after apply)
!~      routes                      = [
-           {
-               protocol = "http1" -> null
-               route    = "ts-devtools-prototyping-capoc-stage-egress-egress-proxy-staging.apps.internal" -> null
            },
        ] -> (known after apply)
!~      stack                       = "cflinuxfs4" -> (known after apply)
!~      updated_at                  = "2025-05-07T22:19:44Z" -> (known after apply)
#        (9 unchanged attributes hidden)
    }

  # module.egress_proxy.cloudfoundry_route.egress_route will be updated in-place
!~  resource "cloudfoundry_route" "egress_route" {
!~      destinations = [
-           {
-               app_id           = "c7dc11b3-bfae-469d-817d-5d5fd190206c" -> null
-               app_process_type = "web" -> null
-               id               = "24e55155-3a81-429b-a2ad-59871ea0380e" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
        id           = "aed0ad06-a525-4ad1-9cbd-87f9d735dbb9"
!~      updated_at   = "2025-05-05T21:38:26Z" -> (known after apply)
#        (6 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Run Terraform plan in staging #260](https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/14932925581)